{
        "Rainy_Day_Wizard": "Today is the day I decipher the secret of drought and flood!#$e#Seek knowledge, seek answers. Have a wonderful day, my love.",
        "Rainy_Night_Wizard": "Your clothes are soaked through... We must remove them from you immediately.#$e#So that you do not catch cold!$1#$b#I have no ulterior motives!$1",
        "Indoor_Day_Wizard": "I entered this room in search of... something...#$e#What was it...?",
        "Indoor_Night_Wizard": "Ever glad am I to return to your side each night.#$e#You enchant me, @.",
        "Outdoor_Wizard": "If a chicken and a half laid an egg and a half in a day and a half...#$e#How long did the orange peel lay on the floor...?",
        "spring_Wizard": "The energies of the earth are most potent this time of year. It is beneficial to focus my studies accordingly.#$e#If you would like, I might teach you more about the threads that tangle every life on your farm together.",
        "summer_Wizard": "This heat is an affront to nature! Not even the elementals of fire could focus in such a stifling atmosphere$1#$e#I shall accomplish nothing until the sun sets.",
        "fall_Wizard": "Wind blows swiftly between the elemental planes. Can you hear them whispering, as they pass us by?#$b#Shh! Listen.$1#$e#You make an adept young witch, for a farmer.",
        "winter_Wizard": "The elementals of water encompass the world in an icy embrace. All that remains for us to do is reach out and touch them.#$e#Will you reach with me, @?",
        "Rainy_Day_0": "The air is heavy with energy, today.#$b#Remember: rain is merely a gift from the plane of water.",
        "Rainy_Day_1": "Though a seed might hold all the potential for life, it is the rains that release it.#$b#Earth and water are as a lock and key.",
        "Rainy_Day_2": "Ah! Gone is the glaring light of the sun!$1#$b#Today shall be a productive one. I hope to same for you, @",
        "Rainy_Day_3": "The elementals of water surround us. There is no time to waste!$1#b#I will be hard at my work, this day.#$e#Focus your mind today, @, and be at peace.",
        "Rainy_Day_4": "Ah ha!$1#$b#This weather brings with it deep understanding of the relationship between the energies of the sky and air. I must write this down.#$e#Now where did I put my notebook?",
        "Rainy_Night_0": "Ah, @! You are utterly sodden!$1#$b#Come. Allow me to warm you.",
        "Rainy_Night_1": "I have heard that it is common in marriage for one to make the other a hot meal on a cold day's end.#$b#I fear my skills do not extend to that realm... but I found this in the fridge... [280 274 270 266 252 250]#$e#Perhaps you could make something and pretend I helped?",
        "Rainy_Night_2": "On this stormy night, I ventured into the town for your benefit. I have acquired, from the saloon, something to warm you. [199 218 219 236]#$e#Perhaps we could pretend I made it?",
        "Rainy_Night_3": "I see the rains have blessed your hair. It is a rare occurrence, indeed, that I am the better groomed between us.",
        "Rainy_Night_4": "@, @, @.#$b#The earth has carressed you with a touch of rain.#$e#You are truly magnificent.",
        "Indoor_Day_0": "Good morning, @, my heart. How did you sleep?#$e#Beside you, I always sleep well.",
        "Indoor_Day_1": "Today we continue your training. Have you been practicing, as I have showed you?#$e#Stand very still. You must forsake your ears listen with your mind.#$b#Only then will you truly understand the energies of the universe.",
        "Indoor_Day_2": "Come, @, let us meditate.#$e#You shall never improve if you never practice.",
        "Indoor_Day_3": "I attempted to make breakfast for you, this morning.#$e#Attempted, being the operative word.#$e#I am afraid you will have to make do on your own.",
        "Indoor_Day_4": "I thought about trying my hand in the kitchen, again. I got as far as staring at that contraption with the large knobs. What did you call it? A stove?#$e#Perhaps I should stick with my potions... a cauldron is a simple thing.",
        "Indoor_Night_0": "I had excess supplies for my ritual, today. [60 62 64 66 68 70 72 74 386]#$e#Perhaps you can put it to use.",
        "Indoor_Night_1": "Ah, @. It warms my soul to have you once more beside me.#$b# Come. Speak to me of your day; I wish to hear everything.#$e#Me? I encountered a curious sprite lost between planes. I was able to guide it back on course, with no harm done.",
        "Indoor_Night_2": "No, I did not attempt to make dinner. No, there is nothing in the sink.#$b#Burnt smell? What burnt smell?#$e#I have no idea what you speak of.",
        "Indoor_Night_3": "I encountered young Leah, today, in the forest. When she beheld me, she said 'what is up, canis lupus familiaris?' and began laughing uncontrollably.#$e#Is this some conversational ritual I am unfamiliar with?",
        "Indoor_Night_4": "@. Core of my heart. Welcome home, my love. It is difficult for me to understand how I lived so long without you, when each day I spend every minute awaiting your return.#$e#Except the minutes when I commune with the energies. Sometimes I lose those minutes. But every other minute, my mind is yours.",
        "Outdoor_0": "Have you ever experienced crop circles on your farm?#$e#Some say they are the work of aliens. Fools. Did they never think to look at what was right under their noses?#$b#Of course it is the elementals.",
        "Outdoor_1": "Ah, @, you're just in time.#$b#I am about to begin my meditation to reach across plains. You should join me#$e#Practice makes perfect.",
        "Outdoor_2": "I require some space to perform a ritual. You don't mind if I use just a little bit, do you?#$e#I won't destroy much of anything.#$b#...unless things go wrong.",
        "Outdoor_3": "The summoning circle is complete!$1#$b#Now I only need to collect a few more supplies...#$e#Ah... incidentally... you didn't need those... crops in the far field, did you...?",
        "Outdoor_4": "Some days I find myself sluggish and lethargic, in spite of a full night's sleep.#$b#The energies are a fickle thing.#$e#But seeing you hard at work energizes me.",
        "OneKid_0": "Despite the focus I have on my studies, I had always wanted to be a father. At long last, I can see this wish come true.#$e#Just one more thing you have granted me.",
        "OneKid_1": "I have come to realize how little I understand about children. If I thought communication with humans was difficult, it is nothing compared to communication with a child. Why does %kid1 not heed me?#$b# I have tried every language I have at my disposal!$1#$e#What do you mean babies do not speak?",
        "OneKid_2": "%kid1 is not so different from an elemental: born of the energies of the universe, unforgiving, and utterly incomprehensible.#$e#Do you think %kid1 would like swamp moss, as well? I believe I have some here, somewhere...",
        "OneKid_3": "You aren't leaving us here alone, are you?$1#$b#Is that... entirely wise?#$b#Very well, but I sense there is at least a fifty percent chance that either %kid1 or I will not survive your absence.#$e#Wait! Before you leave!$1#$b#How does a pacifier function?$1#$b#Is there milk in the fridge? What temperature should I heat it to?$1#$b#How long should %kid1 nap?$1#$b#What if %kid1 cries?$1#$b#Will you be back for lunch? Dinner?$1#$b#How do I change a diaper?$1#$b#What is the purpose of a baby blanket?!$1#$e#Please return soon.",
        "TwoKids_0": "When I said I wished to be a father, I do not think I fully understood the implications.#$b#What I meant was that I should like to have the knowledge that I had brought a life into this world, and to watch a child grow to maturity and strength before he moved on to do good unto the world.#$e#I did not realize that involved quite so much work.",
        "TwoKids_1": "Do you find it unsettling that %kid1 and %kid2 might have a half-sibling among the villagers?",
        "TwoKids_2": "I went to work in my tower, the other day, expecting increased productivity in the quiet... and yet, as soon as %kid1 and %kid2 were out of my sight, I felt an ache of longing to hold them in my arms once more. I could not even focus for long enough to complete a single ritual.#$e#Is this what it means to be a father?",
        "TwoKids_3": "%kid1 has your eyes. Sometimes we lock gazes and I find myself lost in them. I wonder what a child sees when looking upon one such as I.#$e#A father, I hope. And nothing less.",
        "Good_0": "Once I was a young man, foolish and restless and hungry for knowledge.#$b#I used to lament the loss of those days - it is an oft-stated tragedy that youth is wasted on the young - but I have come to realize that such days of vibrant energy are not lost to me.#$b#You have brought them back, @.#$e#You give me life anew, as I never expected to have.#$b#For this I can never repay you, but ever will I try.",
        "Good_1": "The dark dreams of my past are a fading memory. When I sleep at your side, not only do I sleep - an uncommon enough occurrence, once - but I sleep soundly.#$b#That is your doing. The calm of your soul soothes mine.#$e#When you are with me, I am invigorated.",
        "Good_2": "Before we wed, I considered my life more or less at an end.#$b#I would toil on through the land of the living for some untold number of decades, in all likelihood, but it was as a flat ground at the bottom of a slope. Already I had climbed the mountain and come down the other side.#$b#I thought I should see no more mountains, in my time. And yet, here we are.#$e#You give my life new purpose, @.",
        "Good_3": "@.#$b#My @.#$b#How effortlessly you make me forget my flaws and past failures!$1#$b#When I see myself through your eyes, it is as if I have been reborn. That you could know all you know of me and still love me so is beyond even my comprehension.#$b#I am undeserving of such devotion, but neverthless I thank you for it.#$e#Never will I fail you. I swear it.",
        "Good_4": "Have I expressed, lately, how I feel for you? If not, I have been remiss.#$b#My love for you overwhelms every other truth of my soul. Without you, I was a husk of a man, adrift in a world without meaning and lamenting my place in it.#$b#With you, I am as a slate wiped clean.#$e#I have no regrets, anymore.",
        "Good_5": "Any trace of that loneliness which once plagued me is banished by your presence. I had no idea how much I craved a contact outside the ethereal before our paths crossed.#$b#And now our souls are entwined as two trees grown together.#$e#It would take an axe to separate us.",
        "Neutral_0": "I hope you won't regret your decision to marry me when my hair turns grey and you are still quite young...",
        "Neutral_1": "There are potent energies about your grandfather's shrine.#$b#Do you think he would be proud of how far you have come?#$e#I believe he is.",
        "Neutral_2": "Ah, @. Come for another lesson on the energies? I'm happy to oblige.#$e#It means more time with you.",
        "Neutral_3": "I once thought I would live out the rest of my days locked away in that tower without even a single friend...#$e#You set that ambition on its nose#$b#Not that I'm complaining.",
        "Neutral_4": "Hmm...? Yes, I'll pick up the pile of books as soon as I'm finished...",
        "Bad_0": "You know I have been married once before and it went badly. I would not like for this to go the same direction.#$e#I do not think my heart would survive the breaking for a second time.",
        "Bad_1": "Black omens darken the horizons of our future.#$b#Will you heed the signs and change course, or will you continue as you have been?#$e#Do not make a choice you will later regret, @.",
        "Bad_2": "This is... hmm. Interesting. If I can just focus my energies, I might be able to...#$e#...#$e#Hm? Begone; I am busy. You would not understand something so delicate.",
        "Bad_3": "And so begins the fall beyond the summit... The descent will not be as joyous as the climb was, I fear.#$b#I wonder if we will catch out bearings before the landslide crumbles out of control...#$e#It pains me to look back and see how far we have fallen, already.",
        "Bad_4": "Hmph.",
        "funLeave_Wizard": "I require some things from my tower; if you seek me there, today, you will find me.#$e#Embrace the mysteries of the day, @.",
        "funReturn_Wizard": "To return to this home we share is a relief. Never before had I thought of my tower as empty, and yet it feels that way without you there.#$e#I passed a productive day, nevertheless.#$b#Come, let us be together and share in each other's memories.",
        "spring_1": "The energies have begun again. Spring is here, and the year is reborn.#$e#I feel renewed this year, not just because spring is the time for it, but because of my relationship with you, @.#$b#You have reminded me that I am still human. To focus on being human is a mystery itself that I almost forgot about.#$e#Thank you, @.",
        "spring_2": "I am always glad to wake beside you, @. I had predicted we would become friends, but I had no idea how far it would go.#$b#There are many mysteries in this world, and I am glad you chose me as one of yours.#$e#I count myself to be very lucky indeed.",
        "spring_3": "Many people are scared of me. The unknown causes them to tremble, and my association with it frightens them.#$b#You have continued to show you don't mind the mysterious. You embrace it, and take time out of your day to see me.#$b#Thank you, @. I thought I would be alone forever.#$e#You are a special person, indeed.",
        "spring_4": "The energies, at their core, are chaotic. Ever changing, they are denser than air yet more elusive than wind.#$b#In the end, many people believed it was not worth trying to solve the mystery, yet here I remain.#$e#Someday, @, I will truly understand.",
        "spring_5": "I feel renewed this year, not just because spring is the time for it, but because of my relationship with you, @.#$b#You have reminded me that I am still human. To focus on being human is a mystery itself that I almost forgot about.#$e#Thank you, @.",
        "spring_6": "The air is electric, I feel this year will be a special one. Let us do our best to achieve our dreams, @.#$e#Do not give up. I will be with you.",
        "spring_7": "The greatest energies are the ones we allow ourselves to find. Everything else is false.#$b#Be true to what moves you, and you will be energized the rest of your life.#$e#That is my hope for you, @. Live forever!",
        "spring_13": "What, exactly, is the purpose of hidden eggs?#$b#Is there some symbolism I don't comprehend?#$b#The eggs, perhaps, represent that which you need but do not desire, and so you seek because you must.#$e#No...?#$e#Of course I'm not going.#$b#I have quite enough mystery in my life without incomprehensible traditions.",
        "spring_24": "...You want me to attend the Flower Dance?$1#$b#I think not. Such frivolous displays are beyond me.#$b#Besides, I'm much too old to dance.#$b#You'll just have to enjoy yourself without me.#$e#...#$b#Please don't dance with anyone else.",
        "summer_1": "Summer has come at last. The energies are at their most powerful. I'll get a lot of work done this season.#$b#Stay cool, @, and do not let the sun curse you.#$e#Maybe we'll go swimming this time...",
        "summer_2": "I still marvel that you would ever choose to be with one such as me. I am much too old and jaded for someone so full of life. And yet, here we are.#$e#You are the mystery I will never solve. Have an enchanted day, @.",
        "summer_3": "Ignorance is bliss. You've heard that saying before, I'm sure, but it's true. To know too much, it can turn one bitter.#$b#I still find hope in my studies, but some days, it is nearly too much to bear. Thank you for choosing me, @.#$e#You are what holds me to this reality.",
        "summer_4": "The focus on my life has always been on my studies now. Everything else fell away.#$b#Becoming clse with you, though, has made me realize that maybe I should not be so consumed by the search for knowledge..#$b#There's more to life than reading the books about the lives of the dead.#$b#Now there is you.#$e#I am with you, @. I always will be.",
        "summer_5": "Using the energies comes at a cost. It's not free. To discuss all the different aspects would take ages.#$b#I'll tell you this though, @. My hair was not originally purple.#$e#That was a long time ago...",
        "summer_6": "One can get so caught up in work that life just falls away. Others retreat to their work because they cannot handle their life.#$b#I'm realizing lately that I've done a lot of things that I wasn't happy with. Forced myself to do what was wrong for what I thought was right.#$b#I hope to someday get forgiveness, @.#$e#Someday.",
        "summer_7": "There is a special energy in the air today. I can feel it, can you?#$b#It is the energy of our love! It is invigorating. It makes me feel young again.$1#$e#Is that weird? I don't get out much, @.",
        "summer_11": "I have no interest in this governor, nor in the pomp and ceremony designed to impress him.#$b#But I will attend the festival.#$e#The activity on the beach draws out curious merfolk.#$b#It provides me a unique opportunity to converse with them.",
        "summer_28": "The season of the Lunaloos is upon us.#$b#Of all the peculiar things people in this town choose to celebrate, this is the one I can understand.#$e#I would prefer to avoid the crowds on the docks, however.#$b#I'm sure you'll find me, regardless.#$b#You always do.",
        "fall_1": "Can you feel the changes in the air? I don't just mean in the temperature. The trees, they are giving off a unique energy.#$e#May this fall be an enchanted one.",
        "fall_2": "Studying and using the energies can make one very tired, @. All these years of it has brought me to the brink.#$b#Yet it is my curiosity that drives me. I don't have all the answers, and there are still questions I have.#$b#Like you, @. What continues to bring you back to me, time and again?#$e#Perhaps someday I will understand you.#$b#Then again, I enjoy the mystery.",
        "fall_3": "There have been times when I have had the chance to wield unlimited energy. Many would be tempted by such power.#$b#I am only human. I was lucky to reject them, for it would have destroyed me.#$b#All that glimmers is not always good, @.#$e#Who knows what I would have become? A scary thought.",
        "fall_4": "Am I a better person than I was before all this? In all my searching, have I been able to find a way to become stronger?#$b#I have answers to many mysteries, but they haven't changed me. They are only answers. Have I done all I can?#$e#I have thought about these things for a long time. My own mystery.",
        "fall_5": "Words can't express how grateful I am for you, @. It is nice to be able to talk with someone about all the aspects of my work.#$e#Among other things.",
        "fall_6": "I have been focusing my energies lately to find the answer to this question: how is it that when I'm out and about I'm tired, but when I try to sleep, I cannot?#$b#It is a grand mystery, @. Someday I will solve it.#$e#Until then, I count on your soothing presence to lull me to sleep each night.",
        "fall_7": "It is difficult to remember what it is to have normal conversations. When conversing with the energies, one must speak a unique and complex language.#$b#To talk human is to ask how another is, and to do that with meaning is hard for me. Luckily, I can practice on you.#$e#What's up, dog? No? Is that not a saying?",
        "fall_16": "My old friend Welwick has come to town for the fair.#$b#Her divination skills outshine even mine.",
        "fall_27": "I will be making another maze for the festival, tonight.#$e#It's the only time of year I can contrive such a simple way for the elementals to observe the affairs of mundane folk so closely.",
        "winter_1": "It is a time for peace and study. The snow fall has made me weak, and I will rest.#$e#I hope this will be a special winter for us, @.",
        "winter_2": "I wish I could reveal my true name to you, @. In truth, I just don't remember it.#$b#Was it Carl? Or Hank? Maybe John?#$b#I think it was a good name. It's hard to know.#$e#Maybe it was @! Imagine that?",
        "winter_3": "There is a great feeling in our relationship. I hope someday to be able to be as natural as I am with you with the whole village.#$b#They still fear but, someday, hopefully, they'll give me a chance. You have.#$e#That's made all the difference.",
        "winter_4": "My name is...I still don't remember.#$b#No, the 'M' doesn't stand for anything. Or, at least, it didn't.#$b#I suppose I could make something up. That's where 'Rasmodius' came from.#$b#Magus. A good, wizardly name, don't you think?#$b#Or should I try mundane?#$b#Mark?#$e#It's no use. If you tire of 'Wizard'... well. Rasmodius is alright, no?",
        "winter_5": "What a year it has been. I'm glad we have grown so close, @. It would have been very boring without you.#$b#Just me and the Shrine of Illusion, making faces at each other.$1#$e#I still make faces at the Shrine. I'm not sure it appreciates it.",
        "winter_6": "All in all, remember this, @: the only energy you truly need is your own.#$b#Use that logic, and seize the day. Let nothing stop you!#$e#Unless it's not a good idea, in which case, don't do it.",
        "winter_8": "Hmm...? The festival?#$b#I have no interest in fish or ice sculptures.#$b#And you know full well I'm no good at socialization.#$e#I think I will visit my tower, instead.#$b#In spite of the weak ambient energy this time of year, I believe I can muster the strength to occupy myself.",
        "winter_15": "Night Market?#$b#Bah! I have no time for such frivolous affairs.$1#$b#Not even the merfolk would bother with that light parade.#$e#By all means, enjoy yourself.#$b#It's just not for me.",
        "winter_25": "All those people gather together to feast over the supposed good fortune of the Winter Star, and it isn't even a star.#$b#Not that anyone - excepting you, of course - would listen if I tried to tell them that, in the deep of winter, even an untrained eye can see the glimmer of of the astral plane.#$e#I do support a celebration of the waxing energies. But I don't support this ignorance.#$b#I'm sure you'll enjoy yourself.",
        "spouseRoom_Wizard": "Strange Basilisks... Fundamentals Of Goblins... Unicorns of Timor-Leste...#$e#No, no, that's not it...#$e#Where did I leave that book...?",
        "patio_Wizard": "...Hmm? It's a ritual circle.#$e#You remember. From our lessons."
}